; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-5-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p1-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s2)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at package1 s1)
	(at package2 s1)
	(at package3 s2)
	(at package4 s2)
	(at package5 s0)
	(at package6 s2)
	(at package7 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 61)
	(= (time-to-walk p0-1 s0) 61)
	(= (time-to-walk s1 p0-1) 41)
	(= (time-to-walk p0-1 s1) 41)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 14)
	(= (time-to-walk p1-2 s1) 14)
	(= (time-to-walk s2 p1-2) 98)
	(= (time-to-walk p1-2 s2) 98)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 4)
	(= (time-to-drive s1 s0) 4)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 13)
	(= (time-to-drive s2 s0) 13)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 93)
	(= (time-to-drive s2 s1) 93)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s1)
	(at truck2 s2)
	(at truck3 s1)
	(at truck4 s2)
	(at truck5 s1)
	(at package1 s2)
	(at package2 s0)
	(at package3 s2)
	(at package4 s2)
	(at package5 s1)
	(at package6 s0)
	(at package7 s0)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 4  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 6 of 13
2. (drive-truck truck4 s1 s2 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   changed: (driven) from 0 to 93
   goals met: 7 of 13
3. (walk driver3 s2 p1-2)
   deleted: (at driver3 s2)
   added: (at driver3 p1-2)
   changed: (walked) from 0 to 98
   goals met: 7 of 13
4. (load-truck package6 truck4 s2)
   deleted: (at package6 s2)
   added: (in package6 truck4)
   goals met: 7 of 13
5. (walk driver3 p1-2 s1)
   deleted: (at driver3 p1-2)
   added: (at driver3 s1)
   changed: (walked) from 98 to 112
   goals met: 8 of 13
6. (drive-truck truck4 s2 s0 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (driven) from 93 to 106
   goals met: 7 of 13
7. (unload-truck package6 truck4 s0)
   deleted: (in package6 truck4)
   added: (at package6 s0)
   goals met: 8 of 13
8. (load-truck package5 truck4 s0)
   deleted: (at package5 s0)
   added: (in package5 truck4)
   goals met: 8 of 13
9. (drive-truck truck4 s0 s1 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 106 to 110
   goals met: 8 of 13
10. (unload-truck package5 truck4 s1)
   deleted: (in package5 truck4)
   added: (at package5 s1)
   goals met: 9 of 13
11. (load-truck package1 truck4 s1)
   deleted: (at package1 s1)
   added: (in package1 truck4)
   goals met: 9 of 13
12. (load-truck package2 truck4 s1)
   deleted: (at package2 s1)
   added: (in package2 truck4)
   goals met: 9 of 13
13. (drive-truck truck4 s1 s0 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 110 to 114
   goals met: 9 of 13
14. (unload-truck package2 truck4 s0)
   deleted: (in package2 truck4)
   added: (at package2 s0)
   goals met: 10 of 13
15. (drive-truck truck4 s0 s2 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (driven) from 114 to 127
   goals met: 11 of 13
16. (unload-truck package1 truck4 s2)
   deleted: (in package1 truck4)
   added: (at package1 s2)
   goals met: 12 of 13
17. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   changed: (walked) from 112 to 153
   goals met: 11 of 13
18. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   changed: (walked) from 153 to 214
   goals met: 11 of 13
19. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 11 of 13
20. (drive-truck truck3 s0 s1 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 127 to 131
   goals met: 12 of 13
21. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 13 of 13
